# -----------------------------------------------------------
# Nome: Exercícios de Loop
#------------------------------------------------------------ 
# Data: 05/05/2023  |Desenvolvedora: Natália Ap. Samogim
# ----------------------------------------------------------- 
# Função: Fibonacci
# ----------------------------------------------------------- 
# Descrição: Gerar a série até a posição 500
# -----------------------------------------------------------

n1=0
n2=1
cont=0
print(cont,'°:',n1)
cont=1
print(cont,'°:',n2)

while (cont!=500):
    num=n2+n1
    n1=n2
    n2=num
    cont=cont+1
    print (cont,'°:',num)
    